Revit 2024 API
ParameterValuePresenceRule Class
 Tests whether an element's parameter has a value or not.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020
Syntax
C#
public class ParameterValuePresenceRule : FilterRule
Visual Basic
Public Class ParameterValuePresenceRule _
	Inherits FilterRule
Visual C++
public ref class ParameterValuePresenceRule : public FilterRule
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FilterRule
 Autodesk.Revit.DB.ParameterValuePresenceRule
 Autodesk.Revit.DB.HasNoValueFilterRule
 Autodesk.Revit.DB.HasValueFilterRule
See Also
ParameterValuePresenceRule Members
Autodesk.Revit.DB Namespace